[net]
batch=64
subdivisions=1
height=28
width=28
channels=1
momentum=0.9
decay=0.0005

learning_rate=0.05
policy=poly
power=4
max_batches=5000

[convolutional]
batch_normalize=0
filters=32
size=3
stride=1
pad=1
activation=leaky

[xnor-conv]
batch_normalize=0
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[xnor-conv]
batch_normalize=0
binary=0
filters=256
size=14
stride=1
pad=0
activation=leaky

[connected]
filters=10
output= 10
size=1
stride=1
activation=leaky


[softmax]
groups=1

[cost]

